message_text_help = '''
<em>/start</em> - <strong>команда для старта бота</strong> (по умолчанию включен)\n
<em>Подписаться [Название_Группы]</em> - <strong>подписаться на рассылку расписание</strong>\n
<em>Отписаться [Название_Группы]</em> - <strong>отписаться от рассылки расписание</strong>\n
<em>Тёмная тема</em> - <strong>получаться рассылку расписание в тёмной теме</strong>\n
<em>Светлая тема</em> - <strong>получаться рассылку расписание в светвлой теме</strong>\n
        '''


message_text_start = '''
<strong>Приветствую дорогой студент👋<strike>или уже не студент</strike>\n
🦾Я бот позволяющее предоставить тебе расписание твоей группы👨‍💻\n
Напиши мне: подписаться [Название_Группы] (без квадратной скобки)</strong>
        '''